# Множества и словари
# коллекции не имеют дублей
# нет порядка, произвольный порядок

# vowels = {'а', "е", "и", "о", "у", "ы", "ю", "я", "э"}
# print(vowels)
# print(type(vowels))
# empty_set = set()
# print(f"{len(empty_set)}")

# word = 'collections'
# letters = set(word) # не упорядоченная коллекция, меньше места занимает
# print(letters)

# animals = ["слон", "тигр", "слон", "зебра", "тигр", "тигр", "зебра"]
# print(set(animals))

# vowels = {'а', "е", "и", "о", "у", "ы", "ю", "я", "э"}
# letter = input("enter letter: ")
# if letter.lower() in vowels:
#    print("гласная")
# else:
#    print("согласная")


# vowels = {'а', "е", "и", "о", "у", "ы", "ю", "я", "э"}
# for letter in vowels:
#    print(letter) # каждый раз будет разная последовательность

# # Объединение множеств через "|" (только то, что не повторяется)

# s_1 = {1, 2, 3}
# s_2 = {3, 4, 5}
# s_union = s_1.union(s_2) # s_1 | s_2
# print(s_union)

# Пересечение множеств (только то, что повторяется)

# s_1 = {1, 2, 3}
# s_2 = {3, 4, 5}
# s_intersection = s_1.intersection(s_2) # s_1 & s_2
# print(s_intersection)

# # Вычитание множеств

# s_1 = {1, 2, 3}
# s_2 = {3, 4, 5}
# s_dif = s_1.difference(s_2) # s_1 - s_2
# print(s_dif)

# # Симметричная разность множеств

# s_1 = {1, 2, 3}
# s_2 = {3, 4, 5}
# s_sym_dif = s_1.symmetric_difference(s_2) # s_1 ^ s_2
# print(s_sym_dif)

# определить какие гласные буквы встречаются в слове "коллекция"
# vowels = {'а', "е", "и", "о", "у", "ы", "ю", "я", "э"}
# letters = set("коллекция")
# print(", ".join(letters & vowels))

# Равенство множеств

# s_1 = {1, 2, 3}
# s_2 = {3, 2, 1, 2}
# print(s_1 == s_2) # совпадают в любом порядке

# s_1 = {1, 2, 3}
# s_2 = {1, 2, 3, 4}
# print(s_1 <= s_2) # входит ли 1 подмножество в другое

# s_1 = {1, 2, 3, 4}
# s_2 = {1, 2, 3}
# print(s_1 >= s_2) # содержит ли 1 подмножество в себе другое

# добавить эл-т во мн-во
# s = set()
# s.add(1)
# print(s)

# удалить эл-т мн-ва
# s = {1, 2, 3}
# s.remove(2)
# print(s)

# s = {1, 2, 3}
# s.discard(2) # удаляет без ошибок, только если эл-т есть во мн-ве
# print(s)

s = {'cat', 1, 2, 3}
x = s.pop() # удаление произвольного эл-та из мн-ва
print(x) # запись удаленного эл-та
print(s)

s = {1, 2, 3}
s.clear() # очистка сета (сам пустой сет остается, данные очищает)
